app/helpers/application_helper.rb

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 3]]
---
  def cart_count_over_one
    if @cart.line_items.count > 0
        return "<span class='tag is-dark'>#{@cart.line_items.count}</span".html_safe

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 3]]
---
  def cart_has_items
    return @cart.line_items.count > 0