app/controllers/instruments_controller.rb

SELECT "instruments".* FROM "instruments" ORDER BY created_at DESC
---
  def index
    @instruments = Instrument.all.order('created_at DESC')

INSERT INTO "instruments" ("brand", "model", "description", "condition", "finish", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @instrument = current_user.instruments.build(instrument_params)

    respond_to do |format|
      if @instrument.save

UPDATE "instruments" SET "image" = ?, "updated_at" = ? WHERE "instruments"."id" = ?  [["image", "\"1.jpg\""], ["updated_at", "2020-07-29 18:15:25.583211"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @instrument.update(instrument_params)

SELECT  "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_instrument
      @instrument = Instrument.find(params[:id])