app/controllers/line_items_controller.rb

SELECT  "instruments".* FROM "instruments" WHERE "instruments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "line_items" ("instrument_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["instrument_id", 1], ["cart_id", 1], ["created_at", "2020-07-29 21:58:41.976470"], ["updated_at", "2020-07-29 21:58:41.976470"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-07-29 22:10:13.955704"], ["id", 1]]
---
  def create
    instrument = Instrument.find(params[:instrument_id])
    @line_item = @cart.add_instrument(instrument)

    respond_to do |format|
      if @line_item.save

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 2]]
---
  def destroy
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy